openfoam/OpenFOAM-dev/tutorials/multiRegion/CHT/reverseBurner/constant/solid/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  opaqueSolid;

absorptionEmissionModel constant;

constantCoeffs
{
    absorptivity    0; // opaque
    emissivity      0.1;
    E               0;
}

scatterModel    none;

sootModel       none;


// ************************************************************************* //
