openfoam/OpenFOAM-dev/tutorials/multiRegion/CHT/reverseBurner/system/gas/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            fixedTemperature;

    cellSet         ignition;

    mode            uniform;

    temperature     2000;

    fraction
    {
        type            table;
        values          ((0 0) (0.1 0) (0.2 1) (0.4 1) (0.5 0));
    }
}

// ************************************************************************* //
